# 활용함수

## add_yearmonth : 연도/월 추가

In [173]:
def add_yearmonth(data, startym):
    
    allsub_df = []
    idx = data[data['sky'].isnull()].index

    for i in range(len(idx)):

        if i == 0:
            sub_df = data.iloc[:idx[i]].copy()
        else:
            sub_df = data.iloc[idx[i-1]+1:idx[i]].copy()
        
        sub_df['yearmonth'] = startym + i
        allsub_df.append(sub_df)
    
    last_month = data.iloc[idx[len(idx) - 1]+1:].copy()
    last_month['yearmonth'] = startym + len(idx)
    allsub_df.append(last_month)
    
    new_data = pd.concat(allsub_df, ignore_index=True)
    
    return new_data

## plus_00 : 00 형태

In [174]:
def plus_00(value):
    
    if len(value) == 2:
        pass
    else:
        value = '0' + value
        
    return value

## plus_0000 : 0000 형태

In [175]:
def plus_0000(value):
    
    if len(value) == 4:
        pass
    elif len(value) == 3:
        value = '0' + value
    elif len(value) == 2:
        value = '00' + value
    else:
        value = '000' + value
    
    return value

## preprocessing : 최종전처리

In [176]:
def preprocessing(data ,startym):
    
    # 컬럼명 변경
    data.columns = ['day', 'hour', 'sky']
    
    # add_yearmonth : 연도/월 추가
    data = add_yearmonth(data, startym)
    data['yearmonth'] = data['yearmonth'].apply(str)
    
    # day 컬럼 형태 변경(00)
    data['day'] =  data['day'].astype(int)
    data['day'] = data['day'].apply(str)
    data['day'] = data['day'].apply(plus_00)
    
    # hour 컬럼 형태 변경(0000)
    data['hour'] = data['hour'].apply(round)
    data['hour'] = data['hour'].apply(str)
    data['hour'] = data['hour'].apply(plus_0000)
    
    # 일자 컬럼 생성 & datetime으로 변환
    data['MEA_DDHR'] = data['yearmonth'] + data['day'] + data['hour']
    data['MEA_DDHR'] = pd.to_datetime(data['MEA_DDHR'])
    
    # 컬럼정리
    data = data.drop(columns=['day', 'hour', 'yearmonth'])
    data = data[['MEA_DDHR', 'sky']]
    data.columns = ['MEA_DDHR', 'SKY']
    data['SKY'] = data['SKY'].astype(int)
    
    return data

# 데이터 전처리
## 2016년 데이터

In [177]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [178]:
df_16 = pd.read_csv('../../data/12.rawdata_weather/sky_data/sky_201604-201612.csv')
df_16.shape

(6608, 3)

In [179]:
df_16 = preprocessing(df_16, 201604)
df_16.head()

             MEA_DDHR  SKY
0 2016-04-01 00:00:00    1
1 2016-04-01 01:00:00    1
2 2016-04-01 02:00:00    1
3 2016-04-01 03:00:00    2
4 2016-04-01 04:00:00    2

In [180]:
df_16.tail()

                MEA_DDHR  SKY
6595 2016-12-31 19:00:00    3
6596 2016-12-31 20:00:00    3
6597 2016-12-31 21:00:00    3
6598 2016-12-31 22:00:00    4
6599 2016-12-31 23:00:00    4

In [181]:
df_16.dtypes

MEA_DDHR    datetime64[ns]
SKY                  int32
dtype: object

In [183]:
df_16['SKY'].value_counts()

4    3100
1    1811
3    1018
2     671
Name: SKY, dtype: int64

## 2017년 데이터

In [184]:
df_17 = pd.read_csv('../../data/12.rawdata_weather/sky_data/sky_201701-201712.csv')
df_17.shape

(8771, 3)

In [185]:
df_17 = preprocessing(df_17, 201701)
df_17.head()

             MEA_DDHR  SKY
0 2017-01-01 00:00:00    3
1 2017-01-01 01:00:00    4
2 2017-01-01 02:00:00    4
3 2017-01-01 03:00:00    2
4 2017-01-01 04:00:00    3

In [186]:
df_17.tail()

                MEA_DDHR  SKY
8755 2017-12-31 19:00:00    3
8756 2017-12-31 20:00:00    2
8757 2017-12-31 21:00:00    3
8758 2017-12-31 22:00:00    3
8759 2017-12-31 23:00:00    1

In [187]:
df_17.dtypes

MEA_DDHR    datetime64[ns]
SKY                  int32
dtype: object

In [188]:
df_17['SKY'].value_counts()

4    3498
1    2818
3    1446
2     998
Name: SKY, dtype: int64

## 2018년 데이터

In [189]:
df_18 = pd.read_csv('../../data/12.rawdata_weather/sky_data/sky_201801-201812.csv')
df_18.shape

(8771, 3)

In [190]:
df_18 = preprocessing(df_18, 201801)
df_18.head()

             MEA_DDHR  SKY
0 2018-01-01 00:00:00    1
1 2018-01-01 01:00:00    1
2 2018-01-01 02:00:00    2
3 2018-01-01 03:00:00    3
4 2018-01-01 04:00:00    2

In [191]:
df_18.tail()

                MEA_DDHR  SKY
8755 2018-12-31 19:00:00   -1
8756 2018-12-31 20:00:00   -1
8757 2018-12-31 21:00:00   -1
8758 2018-12-31 22:00:00   -1
8759 2018-12-31 23:00:00   -1

In [192]:
df_18.dtypes

MEA_DDHR    datetime64[ns]
SKY                  int32
dtype: object

In [207]:
df_18[df_18['SKY'] == -1]

                MEA_DDHR  SKY
6890 2018-10-15 02:00:00   -1
6891 2018-10-15 03:00:00   -1
6892 2018-10-15 04:00:00   -1
6893 2018-10-15 05:00:00   -1
6894 2018-10-15 06:00:00   -1
...                  ...  ...
8755 2018-12-31 19:00:00   -1
8756 2018-12-31 20:00:00   -1
8757 2018-12-31 21:00:00   -1
8758 2018-12-31 22:00:00   -1
8759 2018-12-31 23:00:00   -1

[1870 rows x 2 columns]

In [208]:
df_18['SKY'].value_counts()

 4    2887
 1    2182
-1    1870
 3    1034
 2     787
Name: SKY, dtype: int64

In [209]:
df_18_nn = df_18[df_18['SKY'] != -1]
df_18_nn['SKY'].value_counts()

4    2887
1    2182
3    1034
2     787
Name: SKY, dtype: int64

In [210]:
df_18_nn.head(2)

             MEA_DDHR  SKY
0 2018-01-01 00:00:00    1
1 2018-01-01 01:00:00    1

In [211]:
df_18_nn.tail(2)

                MEA_DDHR  SKY
6888 2018-10-15 00:00:00    2
6889 2018-10-15 01:00:00    3

## 2019년 데이터

In [212]:
df_19 = pd.read_csv('../../data/12.rawdata_weather/sky_data/sky_201901-201912.csv')
df_19.shape

(8771, 3)

In [213]:
df_19 = preprocessing(df_19, 201901)
df_19.head()

             MEA_DDHR  SKY
0 2019-01-01 00:00:00   -1
1 2019-01-01 01:00:00   -1
2 2019-01-01 02:00:00   -1
3 2019-01-01 03:00:00   -1
4 2019-01-01 04:00:00   -1

In [214]:
df_19.tail()

                MEA_DDHR  SKY
8755 2019-12-31 19:00:00   -1
8756 2019-12-31 20:00:00   -1
8757 2019-12-31 21:00:00   -1
8758 2019-12-31 22:00:00   -1
8759 2019-12-31 23:00:00   -1

In [215]:
df_19['SKY'].value_counts()

-1    8760
Name: SKY, dtype: int64

## 2020년 데이터

In [216]:
df_20 = pd.read_csv('../../data/12.rawdata_weather/sky_data/sky_202001-202003.csv')
df_20.shape

(2186, 3)

In [217]:
df_20 = preprocessing(df_20, 202001)
df_20.head()

             MEA_DDHR  SKY
0 2020-01-01 00:00:00   -1
1 2020-01-01 01:00:00   -1
2 2020-01-01 02:00:00   -1
3 2020-01-01 03:00:00   -1
4 2020-01-01 04:00:00   -1

In [218]:
df_20.tail()

                MEA_DDHR  SKY
2179 2020-03-31 19:00:00   -1
2180 2020-03-31 20:00:00   -1
2181 2020-03-31 21:00:00   -1
2182 2020-03-31 22:00:00   -1
2183 2020-03-31 23:00:00   -1

In [219]:
df_20['SKY'].value_counts()

-1    2184
Name: SKY, dtype: int64

2018년 10월 15일부터 2020년까지의 데이터가 결측치

# 결측치 없는 데이터만 concat

In [220]:
print(df_16.shape)
print(df_17.shape)
print(df_18_nn.shape)
sky = pd.concat([df_16, df_17, df_18_nn], ignore_index=True)
sky.shape

(6600, 2)
(8760, 2)
(6890, 2)

(22250, 2)

In [221]:
sky.isnull().sum()

MEA_DDHR    0
SKY         0
dtype: int64

In [222]:
sky.to_csv('../../data/22.savedata_weather/sky_20162018.csv', index=False, encoding='utf-8')